app/views/components/_card_task.html.erb

SELECT  1 AS one FROM "tasks" WHERE "tasks"."project_id" = $1 LIMIT $2  [["project_id", 4], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 5]]
---
<% if project.tasks.empty? %>