app/views/projects/index.html.erb

SELECT  1 AS one FROM "tasks" WHERE "tasks"."project_id" = $1 LIMIT $2  [["project_id", 4], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]
---
          </div>
          <% if project.tasks.empty? %>

SELECT  1 AS one FROM "comments" WHERE "comments"."task_id" = $1 LIMIT $2  [["task_id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = $1  [["task_id", 2]]
---

                  <% if task.comments.empty? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
                      <%= comment.description %>
                      <p class="card-text"><small class="text-muted">By <%= comment.user.first_name %></small></p>