app/controllers/comments_controller.rb

INSERT INTO "comments" ("description", "photo", "task_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "dz"], ["photo", "x12cunksnornf67ayf33.jpg"], ["task_id", 15], ["user_id", 6], ["created_at", "2018-11-23 08:35:21.103828"], ["updated_at", "2018-11-23 08:35:21.103828"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.task = @task
    @comment.user = current_user
    @comment.save ? (redirect_to projects_path) : (render :new)