app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.user = current_user
    @project.save ? (redirect_to projects_path) : (render :new)
---
INSERT INTO "projects" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dzadz"], ["user_id", 6], ["created_at", "2018-11-19 07:37:40.863678"], ["updated_at", "2018-11-19 07:37:40.863678"]]

  def update
    @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "dzadzazz"], ["updated_at", "2018-11-19 07:38:07.028025"], ["id", 2]]

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC