app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("status", "priority", "deadline", "created_at", "updated_at", "project_id", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["status", 2], ["priority", 2], ["deadline", "2018-11-19"], ["created_at", "2018-11-19 07:58:55.890027"], ["updated_at", "2018-11-19 07:58:55.890027"], ["project_id", 4], ["description", "dzadz"]]
---
  def create
    @task = Task.new(task_params)
    @task.project = @project
    flash[:alert] = 'Please, fill the description and deadline task fields' unless @task.save

UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "dzadzaaaa"], ["updated_at", "2018-11-19 07:59:02.859038"], ["id", 1]]
---
  def update
    @task.update(task_params)